import json

data = {

    " Студент1 " : {
          "Имя" :"Дмитрий" ,
          "Фамилия" :"Иванович" ,
           "Отчество" : "Петров" ,
           "Адресс" : {
          "Адрес улицы" : "Московская ул., 12, дом. 5",
          "Город" : "Ростов-на-Дону"
            },
          "Примечение" :"Хорошист",

},


  " Студент2 " : {
            "Имя" :"Иван" ,
            "Фамилия" :"Игоревич" ,
            "Отчество" : "Суслов" ,
            "Адресс" : {
              "Адрес улицы" : "Краснодраская ул., 16, дом. 2",
              "Город" : "Ростов-на-Дону"  },
           "phoneNumbers": [
             "834 133-1742",
             "916 181-7375" ],
             "Примечение" :"Шутник",
      },

            " Студент3 " : {
              "Имя" :"Елена" ,
              "Фамилия" :"Владимирова" ,
              "Отчество" : "Тимакова" ,
              "Адресс" : {
                "Адрес улицы" : "Красноярская ул., 16, дом. 2",
                "Город" : "Ростов-на-Дону"  },
              "Номер Телефона": [
               "812 120-1234",
               "916 103-4567" ],
               "Примечение" :"Отличница",
      },







}


with open('result.json','w') as outfile :
    json.dump(data, outfile)
